# messages_fp.py

Messages = {
    "MENU_MAIN": {
        "title": "=== ГЛАВНОЕ МЕНЮ ===",
        "options": [
            "1. Задание 1",
            "2. Задание 2",
            "3. Задание 3",
            "0. Выход"
        ],
        "prompt": "Выберите пункт: ",
        "invalid_choice": "Неверный пункт!",
        "exit": "Выход из программы"
    },

    "TASK1": {
        "title": "=== ЗАДАНИЕ 1 ===",
        "menu": [
            "1. Ввести массивы вручную",
            "2. Сгенерировать массивы случайно",
            "3. Посчитать общие числа",
            "4. Показать результат",
            "5. Назад в главное меню",
            "6. Отключить логирование"
        ],
        "prompt": "Выберите пункт: ",
        "input_error": "Ошибка ввода массивов!",
        "calculation_done": "Подсчёт выполнен.",
        "no_data": "Сначала введите массивы!",
        "invalid_choice": "Неверный пункт!"
    },

    "TASK2": {
        "title": "=== ЗАДАНИЕ 2 ===",
        "menu": [
            "1. Ввести массивы вручную",
            "2. Сгенерировать массивы случайно",
            "3. Найти индексы и возвести суммы в степень",
            "4. Показать массивы и результаты",
            "5. Назад в главное меню",
            "6. Отключить логирование"
        ],
        "prompt": "Выберите пункт: ",
        "input_error": "Ошибка ввода массивов!",
        "calculation_done": "Подсчёт выполнен.",
        "no_data": "Сначала введите массивы!",
        "invalid_choice": "Неверный пункт!"
    },

    "TASK3": {
        "title": "=== ЗАДАНИЕ 3 ===",
        "menu": [
            "1. Ввести массивы вручную",
            "2. Сгенерировать массивы случайно",
            "3. Показать массивы и результат",
            "4. Назад в главное меню",
            "5. Отключить логирование"
        ],
        "prompt": "Выберите пункт: ",
        "input_error": "Ошибка ввода массивов!",
        "processing_done": "Массивы обработаны.",
        "no_data": "Массивы ещё не введены или не сгенерированы!",
        "invalid_choice": "Неверный пункт!"
    }
}
